app/Controllers/Admin.php

SELECT *
FROM `products`
---
    public function index(): string
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();

SELECT *
FROM `products`
WHERE `products`.`ProductID` = '3'
---
    public function edit($id)
    {
        $model = new ProductModel();
        $data['products'] = $model->find($id);

SELECT *
FROM `products`
WHERE `products`.`ProductID` = '3'
UPDATE `products` SET `ProductName` = 'monitor pnp', `Description` = ' <script>alert(\"Hello\")</script>', `Category` = 'Accessories', `Price` = '200.00', `StockQuantity` = '23', `Image` = '1720050441_2d4c852f526704fbc8ee.jpg'
WHERE `products`.`ProductID` IN ('3')
---
    public function update($id)
    {
        // Load the model
        $imageName = '';
        $Model = new ProductModel();
        $model_item = $Model->find($id);
        $old_img_name = $model_item['Image'];
        $file = $this->request->getFile('img');
        if($file->isValid() && ! $file->hasMoved())
        {
            if(file_exists('uploads/'.$old_img_name))
            {
                unlink("uploads/".$old_img_name);
            }
            $imageName = $file->getRandomName();
            $file->move('uploads/', $imageName);
            }else{
            $imageName = $old_img_name;
            }
        // Get form data
        $data = [
            'ProductName'   => $this->request->getPost('ProductName'),
            'Description'   => $this->request->getPost('Description'),
            'Category'      => $this->request->getPost('Category'),
            'Price'         => $this->request->getPost('Price'),
            'StockQuantity' => $this->request->getPost('StockQuantity'),
            "Image"         => $imageName
        ];

        if($Model->update($id, $data)){