app/Controllers/Home.php

    public function index(): string
    {
        $model = new ProductModel();
        $ordermodel = new OrdersModel();
        $data['products'] = $model->findAll();
        $data['orders'] = $ordermodel->findAll();
---
SELECT *
FROM `products`
SELECT *
FROM `orders`

    public function add($id){
        $productmodel = new ProductModel();
        $ordermodel = new OrdersModel();
        $orderDate = date('Y-m-d H:i:s');
        $price = $productmodel->find($id);
        $data = [
            'OrderDate' => $orderDate,
            'ProductID' => $price['ProductName'],
            'Price' => $price['Price'],
            'Status' => "Pending",
            'TotalQuantity' => 1,
        ];
        // Save to database
        if($ordermodel->save($data)){
---
SELECT *
FROM `products`
WHERE `products`.`ProductID` = '5'
INSERT INTO `orders` (`OrderDate`, `ProductID`, `Price`, `Status`, `TotalQuantity`) VALUES ('2024-07-06 02:31:02', 'ryzen pc pro', '10000.00', 'Pending', 1)

    public function deliver()
    {
    $ordermodel = new OrdersModel();

    // Data to be updated
    $data = [
        'Status' => "Delivered",
    ];

    // Update the orders where status is 'pending'
    $ordermodel->where('Status', 'Pending')->set($data)->update();
---
UPDATE `orders` SET `Status` = 'Delivered'
WHERE `Status` = 'Pending'